# WorkshopInstructions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarUpdateCurvesData..::..WorkshopInstructions Property
RebarUpdateCurvesData Class See Also
---
Identifies the workshop instructions of this rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public RebarWorkInstructions WorkshopInstructions { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WorkshopInstructions As RebarWorkInstructions
	Get
```

Visual C++
---
```text
public:
property RebarWorkInstructions WorkshopInstructions {
	RebarWorkInstructions get ();
}
```

# See Also
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace